{
  "header": {
    "navItems": {
      "home": "home",
      "about": "About",
      "projects": "Projects"
    }
  },

  "hero_section": {
    "title": "portfolio",
    "position": "front-end developer",
    "repository": "Portfolio repository",
    "resume": "Download resume"
  },

  "about_section": {
    "id": "about",
    "title": {
      "about": "about",
      "skills": "skills"
    },
    "revealText": "For me, it was just 'I love what I do, so I want to do as much of it as possible.' - Kobe Bryant",
    "description": "I embarked on my journey into the programming world in 2023 as a self-taught enthusiast. Throughout this period, I dedicated myself to various study projects that allowed me to enhance my skills and understanding of fundamental concepts. Now, I feel prepared to embrace professional opportunities that enable me to apply and expand my knowledge. My primary focus is on web and mobile development, with a specialization in React and React Native. I am eager to contribute my passion for programming and my ability to learn quickly to the success of future projects.",
    "nameLabel": {
      "name": "name",
      "birth": "birth",
      "position": "position"
    },
    "fieldValue": {
      "birth": "November 3, 2000",
      "position": "Freelancer, Front-end Developer"
    }
  },

  "projects_section": {
    "id": "projects",
    "title": "projects",
    "projects": {
      "market_admin": {
        "title": "Market Admin",
        "description": "This web project, developed in React and Next.js with TypeScript, provides an effective solution for inventory management. Highlights include secure authentication via Google, an interactive inventory page with features such as addition, deletion, filtering, and export to Excel. The dashboard presents visual insights into inventory by category, using dynamic charts from the Recharts library. Integration with Firebase ensures a reliable experience, while Redux manages the application state for smooth and efficient navigation.",
        "cards": {
          "first": {
            "title": "dashboard",
            "description": "The dashboard page consolidates information about the available products. On it, you will find the total number of products, the total revenue from the products, and the product with the lowest stock. Additionally, there is a chart illustrating the quantity of stock per category."
          },
          "second": {
            "title": "login",
            "description": "The login screen provides quick access via email/password or Google, with secure validation through Firebase. New users can easily register. In case of forgotten password, recovery is possible through a reset email. Convenient and secure."
          },
          "third": {
            "title": "Cloud Firestore",
            "description": "The project is integrated with Firebase, using it as both the database and authentication system. Any interaction with the table is automatically updated in the real-time database."
          },
          "fourth": {
            "title": "table",
            "description": "The product table lists and organizes all available items. Through a simple form, users can add and delete products. Name filtering facilitates searches, and the Excel download option provides convenience in data management."
          }
        }
      },

      "dine_restaurant": {
        "title": "Dine Restaurant",
        "description": "I present Dine, my front-end project inspired by Frontendmentor. Developed with React, I used Hook Form and Zod to enhance form validation efficiently. Styling is done with Styled Components, providing an elegant and flexible design.",
        "cards": {
          "first": {
            "title": "home page",
            "description": "The home page of the 'Dine' project features an impressive design developed with Styled Components. It stands out for its responsiveness and modern layout, providing a engaging visual experience across various devices."
          },
          "second": {
            "title": "modal reservation",
            "description": "A reservation confirmation modal displaying the entered information upon form completion."
          },
          "third": {
            "title": "booking page",
            "description": "The 'Booking Page' is a dedicated page for filling out the restaurant reservation form. Employing validation, the form utilizes the capabilities of Hook Form and Zod to ensure accuracy and integrity of the entered data."
          }
        }
      },

      "nlw_notes": {
        "title": "NLW Notes",
        "description": "Developed during the Rocketseat NLW Expert event, this project allows creating voice notes using the SpeechRecognition API. With technologies such as TypeScript, React, and Tailwind, users can add, edit, and remove notes, both through text and voice.",
        "cards": {
          "first": {
            "title": "Notes",
            "description": "The page displays all notes clearly and provides an intuitive card for adding new notes."
          },
          "second": {
            "title": "New note",
            "description": "A card for adding new notes, enabling voice recording using the SpeechRecognition API, or text input."
          },
          "third": {
            "title": "Certificate"
          }
        }
      },

      "nlw_food": {
        "title": "NLW Food Delivery",
        "description": "This project was created during the Rocketseat NLW event and developed in React Native, utilizing technologies like Zustand and Tailwind. It is a food delivery application, allowing users to choose orders, access the shopping cart, and send the order via WhatsApp message.",
        "cards": {
          "first": {
            "title": "Home page",
            "description": "Developed in React Native, similar to the interface of food delivery apps like iFood. Users can navigate through the intuitive home page and place orders on the store page."
          },
          "second": {
            "title": "Cart",
            "description": "This is the shopping cart page where all selected products are displayed. The page calculates the total order amount. Additionally, there is a message field available for users to input delivery information."
          },
          "third": {
            "title": "Product page",
            "description": "This is the individual product page, showcasing detailed information about the item. Users have the option to add the product to their shopping cart directly from this page."
          },
          "fourth": {
            "title": "Certificate"
          }
        }
      },

      "quiz_app": {
        "title": "Quiz App",
        "description": "The Quiz App is an interactive question and answer application, created as part of a challenge proposed by Frontend Mentor. It offers users the option to choose between light and dark modes. This project was developed using React, Axios, React Query, TailwindCSS, and TypeScript. The quiz content is fully powered by an API, ensuring the update and diversity of the questions.",
        "cards": {
          "first": {
            "title": "home page",
            "description": "The homepage allows users to choose the quiz theme and switch between dark and light layout modes using a toggle switch."
          },
          "second": {
            "title": "home page - dark mode",
            "description": ""
          },
          "third": {
            "title": "questions",
            "description": "The user receives a question, chooses an answer, and upon submitting the response, views both incorrect and correct answers. A progress bar indicates how many questions are still remaining."
          },
          "fourth": {
            "title": "result",
            "description": "Displays the number of correct answers obtained by the user and provides the option to play again."
          }
        }
      },

      "todo": {
        "title": "Todo",
        "description": "The Todo is my first React project, developed in response to a challenge from Frontend Mentor. This responsive task list application offers light and dark modes. Through this project, I was able to explore and apply fundamental React concepts, marking the beginning of my journey in web application development.",
        "cards": {
          "first": {
            "title": "todo",
            "description": "Allows adding and deleting tasks, marking them as completed, filtering between all, active, or completed tasks, and provides a button to clear completed tasks. A counter displays how many tasks are still pending."
          },
          "second": {
            "title": "dark-mode"
          }
        }
      }
    }
  },

  "footer": {
    "title": "contact",
    "subtitle": "Thank you for visiting my portfolio.",
    "message": "If you have any questions, suggestions, or opportunities, please fill out the form below. I look forward to hearing from you!",
    "button": "Send",
    "codeBy": "code by",
    "form": {
      "name": "The name field cannot be empty",
      "email": "The email field is not valid",
      "message": "The message field cannot be empty",
      "toast": "Message sent successfully!"
    }
  },

  "experience": {
    "year": "{count, plural, one {# year} other {# years}}",
    "month": "{count, plural, one {# month} other {# months}}",
    "yearAndMonth": "{yearCount, plural, one {# year} other {# years}} and {monthCount, plural, one {# month} other {# months}}",
    "months": "{count, plural, one {# month} other {# months}}"
  }
}
